Revit 2027 API
IFCParameterTemplate.RemovePropertySet Method
 Removes provided property set from the template.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void RemovePropertySet(
	PropertySetupType propertySetupType,
	string propertySetName
)
Public Sub RemovePropertySet (
	propertySetupType As PropertySetupType,
	propertySetName As String
)
public:
void RemovePropertySet(
	PropertySetupType propertySetupType,
	String^ propertySetName
)
member RemovePropertySet :
        propertySetupType : PropertySetupType *
        propertySetName : string -> unit
Parameters
propertySetupType PropertySetupType
 The property setup type.
propertySetName String
 The property set name.
Exceptions
Exception | Condition
ArgumentException |  A property set with the given name is not present in the template.
ArgumentNullException |  A non-optional argument was null
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
IFCParameterTemplate Class
Autodesk.Revit.DB Namespace